#include  "..\..\..\setting\FilePathMain.mqh" 
//+------------------------------------------------------------------+
//|                                                                  |
//+------------------------------------------------------------------+
void SetSignalModSell( int number){
//+------------------------------------------------------------------
//| ------------- Движение СтопЛоса | Трал ---------------------------------                                               
//| 0 Если параметр ТРАЛА есть и НЕ равен 0                               
//| 1                                               
//+------------------------------------------------------------------
SignalModSell[number] = false; 

//if( Status[number][TRADEMODE_MODIF][TYPE_SELL][0] = false ? true: false )

// Выполнение всех статусов
//if( Status[number][TRADEMODE_MODIF][TYPE_SELL][0] )

SignalModSell[number] = true; 

}



